#+TITLE: Week 4.14 Math Homework
#+AUTHOR: 2024110144 陈有骏
#+LATEX_COMPILER: xelatex
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper,10pt]
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+LATEX_HEADER: \usepackage{xeCJK}
#+OPTIONS: \n:t toc:nil num:nil date:nil

#+begin_comment
4.14
导论 下 7.2 1,2,3中奇数小题
2 1
3 9
#+end_comment

*** 3
$$\iiint_V xy^2z^3dxdydz$$
$$V:\text{由}z=xy,y=x,x=1,z=0\text{围成}$$
$$\begin{align*}
\iiint_V xy^2z^3dxdydz
&= \int_0^1 \int_0^x \int_0^{xy} xy^2z^3 dzdydx\\
&= \int_0^1 \int_0^x \frac{xy^2z^4}{4} |_0^{xy} dydx\\
&= \int_0^1 \int_0^x \frac{x^5y^6}{4} dydx\\
&= \int_0^1 \frac{x^5y^7}{28} |_0^x dx\\
&= \int_0^1 \frac{x^12}{28} dx\\
&= \frac{x^13}{28\times 13} |_0^1\\
&= \frac{1}{28\times 13}\\
&= \frac{1}{364}
\end{align*}$$
#+begin_src scheme :exports both
  (* 28 13)
#+end_src

#+RESULTS:
: 364

*** 5
$$\iiint_V z dxdydz$$
$$V:\text{由}z=\sqrt{4-x^2-y^2},x^2+y^2=3z\text{围成}$$
since $z$ is continuous, we can change the order
$z=\sqrt{4-r^2},z=\frac{r^2}{3}$
when changed to $r,\theta,z$
the ranges becom $(0,2),(0,2\pi),(\sqrt{4-r^2},\frac{r^2}{3})$
$$\begin{align*}
\iiint_V z dxdydz
&= \int_{-2}^2 \int_{-\sqrt{4-x^2}}^{\sqrt{4-x^2}} \int_{\sqrt{4-x^2-y^2}}^{\frac{x^2+y^2}{3}} z dxdydz\\
&= \int_0^{2\pi} \int_0^2 \int_{\sqrt{4-r^2}}^{\frac{r^2}{3}} zr dzdrd\theta\\
&= \int_0^{2\pi} \int_0^2 \frac{z^2}{2} |_{\sqrt{4-r^2}}^{\frac{r^2}{3}} rdrd\theta\\
&= \frac{1}{2} \int_0^{2\pi} \int_0^2 z^2 |_{\sqrt{4-r^2}}^{\frac{r^2}{3}} rdrd\theta\\
&= \frac{1}{2} \int_0^{2\pi} \int_0^2 \frac{r^5}{9}-(4r-r^3) drd\theta\\
&= \frac{1}{2} \int_0^{2\pi} \frac{r^6}{54}-2r^2+\frac{r^4}{4} |_0^2 d\theta\\
&= \frac{1}{2} \int_0^{2\pi} \frac{32}{27}-8+4 d\theta\\
&= \pi \cdot \left(\frac{32}{27}-4\right)\\
&= -\frac{76\pi}{27}
\end{align*}$$
#+begin_src scheme :exports both
  (- 32/27 4)
#+end_src

#+RESULTS:
: -76/27

